Repository: Faenriis/dynamic-panel-transparency
Catalog: dynamic-panel-transparency@rockon999.github.io/locale/*/LC_MESSAGES/dynamic-panel-transparency.po
Languages: ar

source: default
ar: الافتراضي

source: App Tweaks
ar: تطويعات التطبيق

source: Add a Custom WM_CLASS
ar: أضف WM_CLASS مخصصة

source: Classy transparency for your panel.
ar: شفافية أنيقة لشريطك.

source: Website
ar: الموقع

source: Shell Restart Required.
ar: إعادة تشغيل غنوم ضرورية.

source: A shell restart is required to view some of your changes. Do you want to restart now?
ar: يجب إعادة تشغيل غنوم لتأخذ التغييرات مجراها. هل ترغب بذلك الآن؟

source: Transition Speed
ar: سرعة التلاشي

source: Overrides 'gtk-enable-animations'.
ar: أبطل 'gtk-enable-animations'.

source: Force animation
ar: إجبار التحريك

source: Transition Style
ar: نمط التلاشي

source: Linear (default)
ar: خطي (الافتراضي)

source: Sine
ar: جيبي

source: Quadratic
ar: تربيعي

source: Cubic
ar: تكعيبي

source: Quartic
ar: رباعي

source: Quintic
ar: خماسي

source: Exponential
ar: أسي

source: Circle
ar: دائري

source: Elastic
ar: متمدد

source: Bounce
ar: ارتدادي

source: Transitions
ar: التلاشيات

source: Enable custom text coloring
ar: تفعيل اللون المخصص للنصوص

source: Primary Color
ar: اللون الأساسي

source: Secondary Color
ar: اللون الثانوي

source: Use when a window is maximized
ar: الاستعمال عند تكبير النافذة

source: Use when the overview is visible
ar: الاستعمال في نمط الاستعراض

source: Enable text shadowing
ar: تفعيل ظل النص

source: Shadow Color
ar: لون الظل

source: Radius
ar: نصف قطري

source: Horizontal Offset
ar: التوازن الأفقي

source: Vertical Offset
ar: التوازن العمودي

source: Enable icon shadowing
ar: تفعيل ظل الرمز

source: Foreground
ar: المقدمة

source: Unmaximized Opacity
ar: إلغاء الشفافية في حالة عدم التكبير

source: Maximized Opacity
ar: إلغاء الشفافية في حالة التكبير

source: Enable custom opacity
ar: تفعيل إلغاء شفافية مخصص

source: Panel Color
ar: لون الشريط

source: Enable custom panel color
ar: تفعيل لون خاص للشريط

source: Remove excess panel styling
ar: أزل زوائد نمط الشريط

source: (Fixes theme incompatibilities.)
ar: (أصلح التكاملات مع السمة.)

source: Hide corners
ar: أخف الزوايا

source: Background
ar: الخلفية

source: About
ar: حول

source: Advanced...
ar: متقدم...

source: A WM_CLASS is a code that identifies a window. Use this setting if the window you want custom settings for is not part of an application. You can find a window's WM_CLASS with the command 'xprop WM_CLASS'. Enter the second result from 'xprop WM_CLASS' below without quotation marks.
ar: إن WM_CLASS هو شيفرة تعرّف النافذة. استعمل هذه الوحدات إذا أردت تنفيذ إعدادات مخصصة ليست جزءًا من التطبيق. بإمكانك العثور عليها من خلال تنفيذ الأمر xprop WM_CLASS وأدخل هنا النتيجة الثانية للأمر بدون علامات التنصيص.

source: WM_CLASS cannot be blank.
ar: لا يمكن أن يكون WM_CLASS فارغًا.

source: Enable background app tweaks
ar: فعّل تطويعات الخلفية

source: Theme Source
ar: مصدر السمة

source: Always trigger the panel.
ar: دومًا علّم الشريط.
